# h2oai groupby benchmarks

In [52]:
import dask.dataframe as dd

import pandas as pd

In [4]:
src_grp_1e7 = (
    "/Users/powers/Documents/code/forked/db-benchmark/_data/G1_1e7_1e2_0_0.csv"
)

In [5]:
x = dd.read_csv(
    src_grp_1e7,
    dtype={
        "id1": "category",
        "id2": "category",
        "id3": "category",
        "id4": "Int32",
        "id5": "Int32",
        "id6": "Int32",
        "v1": "Int32",
        "v2": "Int32",
        "v3": "float64",
    },
)

In [30]:
print(x.head())

     id1    id2           id3  id4  id5    id6  v1  v2         v3
0  id016  id016  id0000042202   15   24   5971   5  11  37.211254
1  id039  id045  id0000029558   40   49  39457   5   4  48.951141
2  id047  id023  id0000071286   68   20  74463   2  14  60.469241
3  id043  id057  id0000015141   32   43  63743   1  15   7.692145
4  id054  id040  id0000011083    9   25  16920   2   9  22.863525

In [7]:
len(x)

10000000

In [8]:
x.npartitions

8

In [10]:
x.memory_usage(deep=True).compute()

Index         1024
id1       10082944
id2       10082944
id3      112108332
id4       50000000
id5       50000000
id6       50000000
v1        50000000
v2        50000000
v3        80000000
dtype: int64

In [11]:
ddf = x.repartition(partition_size="100MB")

In [12]:
ddf.npartitions

8

In [13]:
ddf.to_parquet("/Users/powers/Documents/tmp/data/h2o/parquet/G1_1e7_1e2_0_0")

(None,)

## q1: sum v1 by id1

In [16]:
%%time
x.groupby("id1", dropna=False, observed=True).agg({"v1": "sum"}).compute()

CPU times: user 36.2 s, sys: 2.13 s, total: 38.4 s
Wall time: 32.7 s

           v1
id1
id016  298268
id039  299711
id047  298115
id043  299557
id054  299408
...       ...
id008  300392
id062  299313
id011  300188
id059  301107
id096  300114

[100 rows x 1 columns]

In [17]:
ddf = dd.read_parquet(
    "/Users/powers/Documents/tmp/data/h2o/parquet/G1_1e7_1e2_0_0", columns=["id1", "v1"]
)

In [18]:
%%time
ddf.groupby("id1", dropna=False, observed=True).agg({"v1": "sum"}).compute()

CPU times: user 263 ms, sys: 68.9 ms, total: 332 ms
Wall time: 117 ms

           v1
id1
id016  298268
id039  299711
id047  298115
id043  299557
id054  299408
...       ...
id008  300392
id062  299313
id011  300188
id059  301107
id096  300114

[100 rows x 1 columns]

## q2: sum v1 by id1:id2

In [19]:
ddf = dd.read_parquet(
    "/Users/powers/Documents/tmp/data/h2o/parquet/G1_1e7_1e2_0_0",
    columns=["id1", "id2", "v1"],
)

In [21]:
%%time
x.groupby(["id1", "id2"], dropna=False, observed=True).agg({"v1": "sum"}).compute()

CPU times: user 37.2 s, sys: 2.8 s, total: 40 s
Wall time: 35.6 s

               v1
id1   id2
id016 id016  3072
      id045  3160
      id023  2931
      id057  2984
      id040  2770
...           ...
id096 id028  3017
      id082  3184
      id065  3159
      id013  2903
      id089  3002

[10000 rows x 1 columns]

## q3: sum v1 mean v3 by id3

In [31]:
ddf = dd.read_parquet(
    "/Users/powers/Documents/tmp/data/h2o/parquet/G1_1e7_1e2_0_0",
    columns=["id3", "v1", "v3"],
)

In [32]:
%%time
ddf.groupby("id3", dropna=False, observed=True).agg(
    {"v1": "sum", "v3": "mean"}
).compute()

CPU times: user 1.66 s, sys: 434 ms, total: 2.09 s
Wall time: 1.58 s

               v1         v3
id3
id0000042202  281  53.198223
id0000029558  327  45.245052
id0000071286  322  49.842035
id0000015141  308  50.790698
id0000011083  307  47.676258
...           ...        ...
id0000009966  318  53.899987
id0000064729  298  48.259954
id0000084431  238  50.899993
id0000089703  323  45.874188
id0000063367  211  50.396047

[100000 rows x 2 columns]

In [33]:
%%time
x.groupby("id3", dropna=False, observed=True).agg({"v1": "sum", "v3": "mean"}).compute()

CPU times: user 39 s, sys: 3.41 s, total: 42.4 s
Wall time: 38.4 s

               v1         v3
id3
id0000042202  281  53.198223
id0000029558  327  45.245052
id0000071286  322  49.842035
id0000015141  308  50.790698
id0000011083  307  47.676258
...           ...        ...
id0000009966  318  53.899987
id0000064729  298  48.259954
id0000084431  238  50.899993
id0000089703  323  45.874188
id0000063367  211  50.396047

[100000 rows x 2 columns]

## q4: mean v1:v3 by id4

In [35]:
ddf = dd.read_parquet(
    "/Users/powers/Documents/tmp/data/h2o/parquet/G1_1e7_1e2_0_0",
    columns=["id4", "v1", "v2", "v3"],
)

In [36]:
%%time
ddf.groupby("id4", dropna=False, observed=True).agg(
    {"v1": "mean", "v2": "mean", "v3": "mean"}
).compute()

CPU times: user 541 ms, sys: 592 ms, total: 1.13 s
Wall time: 452 ms

           v1        v2         v3
id4
1    3.001875  7.995427  49.983907
2    2.998208  7.996927  49.841268
3     3.00001  7.998429  49.880546
4    3.005033  8.008521  50.053042
5    2.999491   8.01399  50.005535
..        ...       ...        ...
96   2.996474  7.983614  49.889232
97   2.995558  7.990926  50.038346
98   2.986841  8.012647  50.124801
99   2.999043   7.98188  49.944407
100   2.99702  8.019508  49.963454

[100 rows x 3 columns]

In [37]:
%%time
x.groupby("id4", dropna=False, observed=True).agg(
    {"v1": "mean", "v2": "mean", "v3": "mean"}
).compute()

CPU times: user 37.7 s, sys: 3.09 s, total: 40.7 s
Wall time: 35.6 s

           v1        v2         v3
id4
1    3.001875  7.995427  49.983907
2    2.998208  7.996927  49.841268
3     3.00001  7.998429  49.880546
4    3.005033  8.008521  50.053042
5    2.999491   8.01399  50.005535
..        ...       ...        ...
96   2.996474  7.983614  49.889232
97   2.995558  7.990926  50.038346
98   2.986841  8.012647  50.124801
99   2.999043   7.98188  49.944407
100   2.99702  8.019508  49.963454

[100 rows x 3 columns]

## q5: sum v1:v3 by id6

In [39]:
ddf = dd.read_parquet(
    "/Users/powers/Documents/tmp/data/h2o/parquet/G1_1e7_1e2_0_0",
    columns=["id6", "v1", "v2", "v3"],
)

In [40]:
%%time
ddf.groupby("id6", dropna=False, observed=True).agg(
    {"v1": "sum", "v2": "sum", "v3": "sum"}
).compute()

CPU times: user 1.22 s, sys: 380 ms, total: 1.6 s
Wall time: 580 ms

         v1   v2           v3
id6
1       278  759  4500.324131
2       296  803  5139.198430
3       233  622  4081.984864
4       282  877  5539.323994
5       267  705  3886.950520
...     ...  ...          ...
99996   339  977  5925.965188
99997   262  745  4610.177984
99998   333  759  5134.606333
99999   305  749  5034.354274
100000  274  806  4651.894027

[100000 rows x 3 columns]

In [41]:
%%time
x.groupby("id6", dropna=False, observed=True).agg(
    {"v1": "sum", "v2": "sum", "v3": "sum"}
).compute()

CPU times: user 37.7 s, sys: 2.76 s, total: 40.5 s
Wall time: 34.7 s

         v1   v2           v3
id6
1       278  759  4500.324131
2       296  803  5139.198430
3       233  622  4081.984864
4       282  877  5539.323994
5       267  705  3886.950520
...     ...  ...          ...
99996   339  977  5925.965188
99997   262  745  4610.177984
99998   333  759  5134.606333
99999   305  749  5034.354274
100000  274  806  4651.894027

[100000 rows x 3 columns]

## q6: Intentionally skipped cause it's commented out

## q7: max v1 - min v2 by id3

In [42]:
ddf = dd.read_parquet(
    "/Users/powers/Documents/tmp/data/h2o/parquet/G1_1e7_1e2_0_0",
    columns=["id3", "v1", "v2"],
)

In [43]:
%%time
ddf.groupby("id3", dropna=False, observed=True).agg({"v1": "max", "v2": "min"}).assign(
    range_v1_v2=lambda x: x["v1"] - x["v2"]
)[["range_v1_v2"]].compute()

CPU times: user 1.4 s, sys: 490 ms, total: 1.89 s
Wall time: 1.47 s

              range_v1_v2
id3
id0000042202            4
id0000029558            4
id0000071286            4
id0000015141            4
id0000011083            4
...                   ...
id0000009966            4
id0000064729            4
id0000084431            4
id0000089703            4
id0000063367            4

[100000 rows x 1 columns]

In [44]:
%%time
x.groupby("id3", dropna=False, observed=True).agg({"v1": "max", "v2": "min"}).assign(
    range_v1_v2=lambda x: x["v1"] - x["v2"]
)[["range_v1_v2"]].compute()

CPU times: user 38.6 s, sys: 2.6 s, total: 41.2 s
Wall time: 36.4 s

              range_v1_v2
id3
id0000042202            4
id0000029558            4
id0000071286            4
id0000015141            4
id0000011083            4
...                   ...
id0000009966            4
id0000064729            4
id0000084431            4
id0000089703            4
id0000063367            4

[100000 rows x 1 columns]

## q8: largest two v3 by id6

In [46]:
ddf = dd.read_parquet(
    "/Users/powers/Documents/tmp/data/h2o/parquet/G1_1e7_1e2_0_0",
    columns=["id6", "v1", "v2", "v3"],
)

In [48]:
%%time
ddf[~ddf["v3"].isna()][["id6", "v3"]].groupby("id6", dropna=False, observed=True).apply(
    lambda x: x.nlargest(2, columns="v3"), meta={"id6": "Int64", "v3": "float64"}
)[["v3"]].compute()

CPU times: user 2min 34s, sys: 12.5 s, total: 2min 46s
Wall time: 2min 34s

                      v3
id6
9     708485   99.930063
      1233683  99.920439
19    82918    97.625727
      625200   97.036998
33    1183098  99.414996
...                  ...
99994 168013   96.185434
99998 136085   99.405711
      197174   99.278838
99999 667180   99.555205
      290571   97.386879

[200000 rows x 1 columns]

In [49]:
%%time
x[~x["v3"].isna()][["id6", "v3"]].groupby("id6", dropna=False, observed=True).apply(
    lambda x: x.nlargest(2, columns="v3"), meta={"id6": "Int64", "v3": "float64"}
)[["v3"]].compute()

CPU times: user 3min 11s, sys: 14.9 s, total: 3min 26s
Wall time: 3min 8s

                      v3
id6
9     708485   99.930063
      1233683  99.920439
19    82918    97.625727
      625200   97.036998
33    1183098  99.414996
...                  ...
99994 168013   96.185434
99998 136085   99.405711
      197174   99.278838
99999 667180   99.555205
      290571   97.386879

[200000 rows x 1 columns]

# q9: regression v1 v2 by id2 id4

In [53]:
ddf = dd.read_parquet(
    "/Users/powers/Documents/tmp/data/h2o/parquet/G1_1e7_1e2_0_0",
    columns=["id2", "id4", "v1", "v2"],
)

In [54]:
%%time
ddf[["id2", "id4", "v1", "v2"]].groupby(
    ["id2", "id4"], dropna=False, observed=True
).apply(
    lambda x: pd.Series({"r2": x.corr()["v1"]["v2"] ** 2}), meta={"r2": "float64"}
).compute()

CPU times: user 7.6 s, sys: 1.93 s, total: 9.52 s
Wall time: 6.38 s

                     r2
id2   id4
id026 9    5.782970e-03
      19   1.125028e-03
      33   1.301960e-03
      44   4.176247e-09
      49   1.178169e-03
...                 ...
id099 58   8.866200e-05
      69   1.797958e-04
      73   2.709881e-03
      77   1.524872e-03
      83   2.586140e-04

[10000 rows x 1 columns]

In [55]:
%%time
x[["id2", "id4", "v1", "v2"]].groupby(
    ["id2", "id4"], dropna=False, observed=True
).apply(
    lambda x: pd.Series({"r2": x.corr()["v1"]["v2"] ** 2}), meta={"r2": "float64"}
).compute()

CPU times: user 44.6 s, sys: 4.54 s, total: 49.1 s
Wall time: 41.7 s

                     r2
id2   id4
id026 9    5.782970e-03
      19   1.125028e-03
      33   1.301960e-03
      44   4.176247e-09
      49   1.178169e-03
...                 ...
id099 58   8.866200e-05
      69   1.797958e-04
      73   2.709881e-03
      77   1.524872e-03
      83   2.586140e-04

[10000 rows x 1 columns]

## q10: sum v3 count by id1:id6

In [57]:
ddf = dd.read_parquet(
    "/Users/powers/Documents/tmp/data/h2o/parquet/G1_1e7_1e2_0_0",
    columns=["id1", "id2", "id3", "id4", "id5", "id6", "v1", "v3"],
)

In [58]:
%%time
ddf.groupby(["id1", "id2", "id3", "id4", "id5", "id6"], dropna=False, observed=True).agg(
    {"v3": "sum", "v1": "size"}
).compute()

CPU times: user 13.6 s, sys: 2.91 s, total: 16.5 s
Wall time: 10.9 s

                                               v3  v1
id1   id2   id3          id4 id5 id6
id016 id016 id0000042202 15  24  5971   37.211254   1
            id0000096717 90  36  24881  68.265721   1
            id0000050660 56  2   31346  69.197638   1
            id0000006913 30  76  22749  60.054044   1
            id0000032257 19  19  41901  71.002708   1
...                                           ...  ..
id054 id002 id0000063962 43  67  18942  51.507418   1
            id0000098794 99  100 27574  96.151364   1
            id0000063695 6   90  7197    2.603732   1
            id0000078453 2   42  53619  74.687472   1
            id0000014636 83  71  67900   5.967089   1

[10000000 rows x 2 columns]

In [59]:
%%time
x.groupby(["id1", "id2", "id3", "id4", "id5", "id6"], dropna=False, observed=True).agg(
    {"v3": "sum", "v1": "size"}
).compute()

CPU times: user 50.7 s, sys: 4.35 s, total: 55 s
Wall time: 45 s

                                               v3  v1
id1   id2   id3          id4 id5 id6
id016 id016 id0000042202 15  24  5971   37.211254   1
            id0000096717 90  36  24881  68.265721   1
            id0000050660 56  2   31346  69.197638   1
            id0000006913 30  76  22749  60.054044   1
            id0000032257 19  19  41901  71.002708   1
...                                           ...  ..
id054 id002 id0000063962 43  67  18942  51.507418   1
            id0000098794 99  100 27574  96.151364   1
            id0000063695 6   90  7197    2.603732   1
            id0000078453 2   42  53619  74.687472   1
            id0000014636 83  71  67900   5.967089   1

[10000000 rows x 2 columns]